{
  "backend/main.mo": "Motoko actor defining Movie, TVShow, and Episode types with CRUD operations stored in Principal-keyed maps, including queries to fetch episodes by TV show and season.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (movie/TV show grids, detail pages, episode player, navigation) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing React components, pages, hooks, and configuration for the StreamHub streaming application.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark modes with neutral grayscale and amber accent colors.",
  "frontend/index.html": "HTML entry point for StreamHub application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining routes for movies, TV shows, detail pages, and episode player with root redirect to /movies.",
  "frontend/src/components/EpisodeCard.tsx": "Horizontal episode card component displaying thumbnail, episode number, title, and duration with play button overlay and navigation to episode player.",
  "frontend/src/components/HeroBanner.tsx": "Hero banner component with generated background image, gradient overlay, and centered StreamHub branding with welcome message.",
  "frontend/src/components/Layout.tsx": "Root layout component wrapping all pages with Navigation header and footer containing copyright and caffeine.ai attribution.",
  "frontend/src/components/MovieCard.tsx": "Vertical movie card component displaying poster, title, genre badge, and duration with hover effects and navigation to movie detail page.",
  "frontend/src/components/Navigation.tsx": "Navigation bar component with sticky header, logo, and links to Movies and TV Shows sections with active state highlighting.",
  "frontend/src/components/TVShowCard.tsx": "Card component displaying TV show thumbnail, title, and episode count with hover effects and navigation to show detail page.",
  "frontend/src/components/VideoPlayer.tsx": "HTML5 video player component with multiple source format support and basic controls for playing video content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching movies, TV shows, and episodes, plus mutations for adding content, all using the actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, including amber accent colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Page component for playing TV show episodes with video player, episode metadata display, and navigation to previous/next episodes within the show.",
  "frontend/src/pages/MovieDetailPage.tsx": "Displays detailed information for a single movie including video player, title, genre, release year, duration, and description. Fetches movie data by ID from the backend actor and handles loading/error states.",
  "frontend/src/pages/MoviesPage.tsx": "Displays a grid of all available movies with a hero banner. Currently returns an empty array as the backend lacks a getAllMovies method, showing a placeholder message when no movies are available.",
  "frontend/src/pages/TVShowDetailPage.tsx": "Displays TV show details with poster, description, and episodes organized by season in tabs. Fetches show and episode data from backend, groups episodes by season number, and provides navigation back to TV shows list.",
  "frontend/src/pages/TVShowsPage.tsx": "Displays a grid of all TV shows with thumbnails and episode counts. Currently returns an empty array as the backend lacks a getAllTVShows method, showing a placeholder message when no shows are available.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended border radius values, custom fonts (Inter, Outfit), animations for accordions, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking document listing completed features (movie/TV show pages, detail pages, navigation, visual theme) and pending feature requests (backend data models, CRUD operations, sample data seeding). Includes image requirements for hero banner and placeholder posters."
}